Grasshopper SDK
GH_Interval1D.a Field
 Start of interval.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public double a
Public a As Double
Field Value
Type: Double
See Also
Reference
GH_Interval1D Structure
GH_IO.Types Namespace