Grasshopper SDK
GH_Version.revision Field
 Revision component of version structure.
 Namespace: GH_IO.Types
 Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public int revision
Public revision As Integer
Field Value
Type: Int32
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace