Grasshopper API
GH_AsynchFileData.LocalUpdatePeriod Field
 Specifies the number of milliseconds in between periodic checks for files on the local system.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public const int LocalUpdatePeriod = 1000
Public Const LocalUpdatePeriod As Integer = 1000
Field Value
Type: Int32
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace