Grasshopper API
GH_Document Fields
The GH_Document type exposes the following members.
Fields
Name | Description
ScheduleInactive
 Defined the delay used to indicate the absence of a schedule.
ScheduleRecursive
 Defines the delay used to indicate the schedule should be immedate and recursive.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace