Grasshopper SDK
GH_AsynchFileData Fields
The GH_AsynchFileData type exposes the following members.
Fields
Name | Description
FilePath
 Gets the location this class is watching.
LocalUpdatePeriod
 Specifies the number of milliseconds in between periodic checks for files on the local system.
RemoteUpdatePeriod
 Specifies the number of milliseconds in between periodic checks for files on network drives.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace