Grasshopper API
GH_Chunk.ChunkKeyedCollection.Remove Method (ID)
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool Remove(
	ID id
)
Public Function Remove (
	id As ID
) As Boolean
Parameters
id
Type: GH_IO.Serialization.ID
Return Value
Type: Boolean
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
Remove Overload
GH_IO.Serialization Namespace