Grasshopper API
GH_Chunk.ChunkKeyedCollection.GetEnumerator Method
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public IEnumerator<GH_Chunk> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of GH_Chunk)
Return Value
Type: IEnumerator<GH_Chunk>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace