Grasshopper API
ID.CompareTo Method
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public int CompareTo(
	ID other
)
Public Function CompareTo (
	other As ID
) As Integer
Parameters
other
Type: GH_IO.Serialization.ID
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
ID Structure
GH_IO.Serialization Namespace