Grasshopper API
GH_Chunk.ChunkKeyedCollection.Add Method
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public void Add(
	GH_Chunk chunk
)
Public Sub Add (
	chunk As GH_Chunk
)
Parameters
chunk
Type: GH_IO.Serialization.GH_Chunk
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace