Grasshopper SDK
GH_Chunk.ChunkKeyedCollection.GetKeyForItem Method
 Get the ID for a given chunk.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
protected override ID GetKeyForItem(
	GH_Chunk chunk
)
Protected Overrides Function GetKeyForItem (
	chunk As GH_Chunk
) As ID
Parameters
chunk
Type: GH_IO.Serialization.GH_Chunk
Chunk to search for.
Return Value
Type: ID
The ID of the specified chunk.
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace