Grasshopper API
GH_DocumentRenderMeshProvider.WillBuildCustomMeshes Method (ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool WillBuildCustomMeshes(
	ViewportInfo vp,
	RhinoObject obj,
	RhinoDoc doc,
	Guid requestingPlugIn,
	DisplayPipelineAttributes attrs
)
Public Overrides Function WillBuildCustomMeshes (
	vp As ViewportInfo,
	obj As RhinoObject,
	doc As RhinoDoc,
	requestingPlugIn As Guid,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
vp
Type: ViewportInfo
obj
Type: RhinoObject
doc
Type: RhinoDoc
requestingPlugIn
Type: System.Guid
attrs
Type: DisplayPipelineAttributes
Return Value
Type: Boolean
See Also
Reference
GH_DocumentRenderMeshProvider Class
WillBuildCustomMeshes Overload
Grasshopper.Kernel Namespace