Grasshopper SDK
GH_YakDownloadForm Constructor
Initializes a new instance of the GH_YakDownloadForm class
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_YakDownloadForm(
	IEnumerable<GH_YakDownloadForm.Item> items
)
Public Sub New (
	items As IEnumerable(Of GH_YakDownloadForm.Item)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<GH_YakDownloadForm.Item>
See Also
Reference
GH_YakDownloadForm Class
Grasshopper.GUI Namespace