Grasshopper SDK
GH_DocumentRenderMeshProvider.BuildCustomMeshes Method (ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override bool BuildCustomMeshes(
	ViewportInfo vp,
	RhinoDoc doc,
	RenderPrimitiveList objMeshes,
	Guid requestingPlugIn,
	DisplayPipelineAttributes attrs
)
Public Overrides Function BuildCustomMeshes (
	vp As ViewportInfo,
	doc As RhinoDoc,
	objMeshes As RenderPrimitiveList,
	requestingPlugIn As Guid,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
vp
Type: ViewportInfo
doc
Type: RhinoDoc
objMeshes
Type: RenderPrimitiveList
requestingPlugIn
Type: System.Guid
attrs
Type: DisplayPipelineAttributes
Return Value
Type: Boolean
See Also
Reference
GH_DocumentRenderMeshProvider Class
BuildCustomMeshes Overload
Grasshopper.Kernel Namespace