Grasshopper SDK
GH_Param<T>.IsolateObject Method
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public override void IsolateObject()
Public Overrides Sub IsolateObject
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace