Grasshopper API
GH_AsynchFileData.StartPeriodicUpdate Method
 Starts periodic updating (from now).
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void StartPeriodicUpdate()
Public Sub StartPeriodicUpdate
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace