Grasshopper API
GH_ComponentServer.LoadExternalFiles Method (Boolean)
 Attempt to parse all external files. This includes GHA libraries, GHUSER objects and GHCLUSTER files.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool LoadExternalFiles(
	bool loadOneByOne
)
Public Function LoadExternalFiles (
	loadOneByOne As Boolean
) As Boolean
Parameters
loadOneByOne
Type: System.Boolean
Ask the user prior to loading each file. This helps narrowing down startup crashes.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ComponentServer Class
LoadExternalFiles Overload
Grasshopper.Kernel Namespace