Grasshopper SDK
Complex.Modulus Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public double Modulus()
Public Function Modulus As Double
Return Value
Type: Double
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace