Grasshopper API
GH_RenderArgs Constructor (RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid)
 Create new render arguments.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public GH_RenderArgs(
	RhinoDoc doc,
	ViewportInfo vp,
	RenderPrimitiveList geometry,
	Guid id
)
Public Sub New (
	doc As RhinoDoc,
	vp As ViewportInfo,
	geometry As RenderPrimitiveList,
	id As Guid
)
Parameters
doc
Type: RhinoDoc
Rhino document.
vp
Type: ViewportInfo
Viewport.
geometry
Type: RenderPrimitiveList
Geometry list.
id
Type: System.Guid
Render plugin id.
See Also
Reference
GH_RenderArgs Class
GH_RenderArgs Overload
Grasshopper.Kernel Namespace