Grasshopper API
IGH_RenderAwareObject.AppendRenderGeometry Method
Note: This API is now obsolete.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute]
void AppendRenderGeometry(
	GH_RenderArgs args
)
<ObsoleteAttribute>
Sub AppendRenderGeometry (
	args As GH_RenderArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
See Also
Reference
IGH_RenderAwareObject Interface
Grasshopper.Kernel Namespace