Grasshopper SDK
Complex.ATan Method
 Namespace: Grasshopper.Kernel.Types
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public Complex ATan()
Public Function ATan As Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace