Grasshopper API
GH_Component.AppendRenderGeometry Method
Note: This API is now obsolete.
 Append all geometry associated with this component to a render queue.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute]
public virtual void AppendRenderGeometry(
	GH_RenderArgs args
)
<ObsoleteAttribute>
Public Overridable Sub AppendRenderGeometry (
	args As GH_RenderArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
Implements
IGH_RenderAwareObject.AppendRenderGeometry(GH_RenderArgs)
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace