Grasshopper API
GH_DocumentRenderMeshProvider.BoundingBox Method (ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public override BoundingBox BoundingBox(
	ViewportInfo vp,
	RhinoObject obj,
	RhinoDoc doc,
	Guid requestingPlugIn,
	DisplayPipelineAttributes attrs
)
Public Overrides Function BoundingBox (
	vp As ViewportInfo,
	obj As RhinoObject,
	doc As RhinoDoc,
	requestingPlugIn As Guid,
	attrs As DisplayPipelineAttributes
) As BoundingBox
Parameters
vp
Type: ViewportInfo
obj
Type: RhinoObject
doc
Type: RhinoDoc
requestingPlugIn
Type: System.Guid
attrs
Type: DisplayPipelineAttributes
Return Value
Type: BoundingBox
See Also
Reference
GH_DocumentRenderMeshProvider Class
BoundingBox Overload
Grasshopper.Kernel Namespace