Grasshopper API
Utility Methods
The Utility type exposes the following members.
Methods
Name | Description
FixNewlines(String)
 Make sure all newlines in a string adhere to the current platform standard.
FixNewlines(String, String)
 Make sure all newlines in a string have a specific pattern.
InvokeDownloader
 Start an asynchronous download operation. The download runs in a separate appdomain. After triggering that process this method returns immediately.
InvokeGetter
 Call a getter property via its name.
InvokeGetterSafe
 Call a getter property via its name. No exceptions are thrown.
InvokeMethod(Object, String)
 Call a method via its name.
InvokeMethod(Object, String, Object[])
 Call a method via its name.
InvokeMethodSafe(Object, String)
 Call a method via its name. No exceptions are thrown.
InvokeMethodSafe(Object, String, Object[])
 Call a method via its name. No exceptions are thrown.
InvokeSetter
 Call a setter property via its name.
InvokeSetterSafe
 Call a setter property via its name. No exceptions are thrown.
LikeOperator
 Exposes the VB.NET Like operator as a static method.
TernaryIf<T>
 Type safe implementation of the IIf conditional statement.
Top
See Also
Reference
Utility Class
Grasshopper Namespace