Grasshopper API
ChunkKeyedCollection Methods
The GH_Chunk.ChunkKeyedCollection type exposes the following members.
Methods
Name | Description
Add
Clear
GetEnumerator
Remove(GH_Chunk)
Remove(ID)
TryGetValue
 Try and find the chunk that belongs to a given ID.
Top
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace