Grasshopper API
EtoExtensions Methods
The EtoExtensions type exposes the following members.
Methods
Name | Description
ToEto(Bitmap) |  Obsolete.
ToEto(Color)
ToEto(Font)
ToEto(Point)
ToEto(Control)
ToEto(Form)
ToSD(Color)
ToSD(Font)
ToSD(Point)
ToSD(Rectangle)
ToSD(Size)
ToWin32Window
Top
See Also
Reference
EtoExtensions Class
Grasshopper Namespace