Grasshopper SDK
GH_NumberSliderSnappingEditor Methods
The GH_NumberSliderSnappingEditor type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_NumberSliderSnappingEditor Class
Grasshopper.GUI Namespace