Grasshopper API
IGH_RenderAwareObject Methods
The IGH_RenderAwareObject type exposes the following members.
Methods
Name | Description
AppendRenderGeometry |  Obsolete.
Top
See Also
Reference
IGH_RenderAwareObject Interface
Grasshopper.Kernel Namespace