Grasshopper SDK
GH_FontControl Methods
The GH_FontControl type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides ContainerControl.Dispose(Boolean).)
OnLayout
Raises the Layout event.
 (Overrides ContainerControl.OnLayout(LayoutEventArgs).)
Top
See Also
Reference
GH_FontControl Class
Grasshopper.GUI Namespace