Grasshopper API
GH_DocumentRenderMeshProvider Methods
Methods
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes).)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes).)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes).)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace