Grasshopper SDK
GH_AsynchFileData Methods
The GH_AsynchFileData type exposes the following members.
Methods
Name | Description
Dispose
StartPeriodicUpdate
 Starts periodic updating (from now).
StopPeriodicUpdate
 Stop any periodic updates.
UpdateProperties
 Updates all file properties on the thread on which this method is called.
UpdatePropertiesAsynch
 Updates all file properties on a low-priority background thread.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace