Grasshopper SDK
GH_PersistentGeometryParam<T> Methods
The GH_PersistentGeometryParam<T> generic type exposes the following members.
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
ConversionCallback |  (Overrides GH_Param<T>.ConversionCallback(Object, T).)
EraseGeometryCaches
ExpireSolution |  (Overrides GH_ActiveObject.ExpireSolution(Boolean).)
OnVolatileDataCollected
 This override removes all instances that fail to load their geometry.
 (Overrides GH_Param<T>.OnVolatileDataCollected().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RegisterRemoteIdsDespiteSources
 Call this method if you wish to register remote ids in the volatile data despite having one or more sources. You should only need to do this if you converted non-referenced data into volatile referenced data.
Top
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace