Grasshopper API
GH_Skin Methods
The GH_Skin type exposes the following members.
Methods
Name | Description
DefaultPalette |  Obsolete.
 Get the default palette as implied by the object state. Locked and Hidden flags are ignored.
LoadSkin
 Instantiate all palette and gui defaults. This function reads the colour values out of grasshopper_gui.xml settings database if it exists.
SaveSkin
 Store all palette and gui defaults. This function writes the colour values out to grasshopper_gui.xml settings database.
Top
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace