Grasshopper API
IGH_VarParamComponent Methods
The IGH_VarParamComponent type exposes the following members.
Methods
Name | Description
ConstructVariable
 This function is called whenever a new parameter is required. You must provide a non-null instance for new_param, otherwise the addition will be cancelled. The Param field of the event arguments will typically be null.
IsVariableParam
 Returns a value indicating whether a specific parameter is considered to be variable.
ManagerConstructed
 This function is called whenever a new manager is constructed. You can override this function if you wish to modify the default behaviour of the manager.
ParametersModified
 This function will be called wheneven the param collection of a component has been altered through the ParamManager. If your parameters have a peculiar naming scheme, this is the best place to assign those.
Top
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace