Grasshopper SDK
GH_MaterialPreviewControl Methods
The GH_MaterialPreviewControl type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides ContainerControl.Dispose(Boolean).)
Top
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace