Grasshopper SDK
GH_Convert Methods
The GH_Convert type exposes the following members.
Methods
Name | Description
BackSolveExpression
 Try and backsolve an expression
ByteArrayToCommonObject<T>
 Convert an OpenNurbs compliant compressed byte array into a RhinoCommon object.
CombineDateAndTime
 Combine a pure date and a pure time.
CommonObjectToByteArray
 Convert a RhinoCommon object into a compressed byte-array using safe Rhino 5.0 OpenNurbs serialization.
CreatePureDate
 Convert a datetime structure into a pure date, i.e. remove the time portion. As per convention, this leaves 1 tick into the day in question intact.
CreatePureTime(DateTime)
 Convert a datetime structure into a pure time, i.e. remove the date portion. As per convention, this means setting the year, month and day to 1.
CreatePureTime(Int32, Int32, Int32)
 Create a pure time instance. If the total number of hours, minutes and seconds exceeds a full year then it is not possible to create a pure time and the largest possible pure time will be returned instead.
FileToHash
 Create a hash of a file.
FindRhinoObjectByNameAndType
 Search the current Rhino document for an object with a given name of a given type.
GetBrepFromDocument
 Harvest a brep object from a Rhino document.
GetCurveFromDocument
 Harvest a curve object from a Rhino document.
GetMeshFromDocument
 Harvest a mesh object from a Rhino document.
GetPointFromDocument
 Harvest a point object from a Rhino document.
GetSurfaceFromDocument
 Harvest a surface object from a Rhino document.
GetTimeKind(DateTime)
 Gets the kind of time implied by a System.DateTime value.
GetTimeKind(DateTime, DateTime)
 Gets the kind of time implied by two System.DateTime values.
IsPureDate
 Tests whether a DateTime instance represents a pure date (i.e. that the time portion is undefined). Pure dates are a Grasshopper convention, basically a pure date is 1 tick past midnight.
IsPureTime
 Tests whether a DateTime instance represents a pure time (i.e. that the date portion is undefined). Pure times are a Grasshopper convention, basically a pure time is 2 ticks past any second.
ObjRefToGeometry
 Convert a Rhino Object Reference into Grasshopper IGH_GeometricGoo.
ParseExpression
 Attempts to parse an expression.
StringToDate
 Convert a string representing a date into an actual date. If a pure date is possible it will be returned. If the input is a pure time this method will fail, you need to use StringToTime instead.
StringToGuid
 Create a Guid based on SHA256 hashing of a string.
StringToTime
 Convert a string representing a time into an pure time. Allowed separators of hour, minute and second portions are colons, semi-colons, points and commas. Grasshopper itself uses colons when formatting times. A PM or AM symbol is allowed provided it does not border on any alphabetical characters. A time can be prefixed by a "X day[s] + " string which defines the total number of 24-hour periods to include.
ToArc
 Convert data into Rhino.Geometry.Arc.
ToArc_Primary
 Performs a direct cast from OnArc or GH_Arc. Data is not quaranteed to be duplicated.
ToArc_Secondary
 Attempts to convert other data types into an OnArc. Data is not quaranteed to be duplicated.
ToBoolean
 Convert data into Booleans.
ToBoolean_Primary
 Performs a direct cast from boolean or GH_Boolean.
ToBoolean_Secondary
 Performs indirect casts from other data types into booleans.
ToBoundingBox_Primary
 Performs a direct cast from OnBoundingBox. Data is not quaranteed to be duplicated.
ToBox_Primary
 Performs a direct cast from Box. Data is not quaranteed to be duplicated.
ToBrep
 Convert data into Rhino.Geometry.Brep.
ToBrep_Primary
 Performs a direct cast from OnBrep or GH_Brep. Data is not quaranteed to be duplicated.
ToBrep_Secondary
 Attempts to convert other data types into an OnBrep. Data is not quaranteed to be duplicated.
ToCircle
 Convert data into Rhino.Geometry.Circle.
ToCircle_Primary
 Performs a direct cast from OnCircle or GH_Circle. Data is not quaranteed to be duplicated.
ToCircle_Secondary
 Attempts to convert other data types into an OnCircle. Data is not quaranteed to be duplicated.
ToColor
 Convert data into Colors.
ToColor_Primary
 Performs a direct cast from Drawing.Color, GH_Color and OnColor.
ToColor_Secondary
 Performs indirect casts from other data types into Colors.
ToComplex
 Convert data into Complex.
ToComplex_Primary
 Performs a direct cast from Complex or GH_ComplexNumber
ToComplex_Secondary
 Performs indirect casts from other data types into Complex.
ToCoordinates
ToCulture
 Convert data into Colors.
ToCulture_Primary
 Performs a direct cast from System.Globalization.CultureInfo and GH_Culture.
ToCulture_Secondary
 Performs indirect casts from other data types into CultureInfo.
ToCurve
 Convert data into Rhino.Geometry.Curve.
ToCurve_Primary
 Performs a direct cast from OnCurve or GH_Curve. Data is not quaranteed to be duplicated.
ToCurve_Secondary
 Attempts to convert other data types into an IOnCurve. Data is not quaranteed to be duplicated.
ToDate
 Convert data into Dates.
ToDate_Primary
 Performs a direct cast from DateTime or GH_DateTime.
ToDate_Secondary
 Performs indirect casts from other data types into DateTime constructs.
ToDouble
 Convert data into Doubles.
ToDouble_Primary
 Performs a direct cast from Double or GH_Number.
ToDouble_Secondary
 Performs indirect casts from other data types into Doubles.
ToGeometricGoo
 Converts an object into GeometricGoo. Does not duplicate the data if a lossless conversion is possible.
ToGeometryBase
 Attempt to convert an object into a Rhino.Geometry.GeometryBase instance.
ToGHArc
 Convert data into GH_Arcs.
ToGHArc_Primary
 Converts similar data into a GH_Arc instance. Data is not quaranteed to be duplicated.
ToGHArc_Secondary
 Converts similar data into a GH_Arc instance. Data is not quaranteed to be duplicated.
ToGHBoolean
 Convert data into GH_Boolean.
ToGHBoolean_Primary
 Converts similar data into a GH_Boolean instance. Data is not quaranteed to be duplicated.
ToGHBoolean_Secondary
 Converts similar data into a GH_Boolean instance. Data is not quaranteed to be duplicated.
ToGHBox
 Convert data into GH_Boxes.
ToGHBox_Primary
 Converts similar data into a GH_Box instance. Data is not quaranteed to be duplicated.
ToGHBox_Secondary
 Converts similar data into a GH_Box instance. Data is not quaranteed to be duplicated.
ToGHBrep
 Convert data into GH_Breps.
ToGHBrep_Primary
 Converts similar data into a GH_Brep instance. Data is not quaranteed to be duplicated.
ToGHBrep_Secondary
 Converts similar data into a GH_Brep instance. Data is not quaranteed to be duplicated.
ToGHCircle
 Convert data into GH_Circles.
ToGHCircle_Primary
 Converts similar data into a GH_Circle instance. Data is not quaranteed to be duplicated.
ToGHCircle_Secondary
 Converts similar data into a GH_Circle instance. Data is not quaranteed to be duplicated.
ToGHColour
 Convert data into GH_Colour.
ToGHColour_Primary
 Converts similar data into a GH_Colour instance. Data is not quaranteed to be duplicated.
ToGHColour_Secondary
 Converts similar data into a GH_Colour instance. Data is not quaranteed to be duplicated.
ToGHComplexNumber
 Convert data into GH_ComplexNumber.
ToGHComplexNumber_Primary
 Converts similar data into a GH_ComplexNumber instance. Data is not quaranteed to be duplicated.
ToGHComplexNumber_Secondary
 Converts similar data into a GH_ComplexNumber instance. Data is not quaranteed to be duplicated.
ToGHCurve
 Convert data into GH_Curves.
ToGHCurve_Primary
 Converts similar data into a GH_Curve instance. Data is not quaranteed to be duplicated.
ToGHCurve_Secondary
 Converts similar data into a GH_Curve instance. Data is not quaranteed to be duplicated.
ToGHGuid
 Convert data into GH_Guid.
ToGHGuid_Primary
 Converts similar data into a GH_Guid instance. Data is not quaranteed to be duplicated.
ToGHGuid_Secondary
 Converts similar data into a GH_Guid instance. Data is not quaranteed to be duplicated.
ToGHInteger
 Convert data into GH_Integer.
ToGHInteger_Primary
 Converts similar data into a GH_Integer instance. Data is not quaranteed to be duplicated.
ToGHInteger_Secondary
 Converts similar data into a GH_Integer instance. Data is not quaranteed to be duplicated.
ToGHInterval
 Convert data into GH_Intervals.
ToGHInterval_Primary
 Converts similar data into a GH_Interval instance. Data is not quaranteed to be duplicated.
ToGHInterval_Secondary
 Converts similar data into a GH_Interval instance. Data is not quaranteed to be duplicated.
ToGHInterval2D
 Convert data into GH_Interval2Ds.
ToGHInterval2D_Primary
 Converts similar data into a GH_Interval2D instance. Data is not quaranteed to be duplicated.
ToGHInterval2D_Secondary
 Converts similar data into a GH_Interval2D instance. Data is not quaranteed to be duplicated.
ToGHLine
 Convert data into GH_Lines.
ToGHLine_Primary
 Converts similar data into a GH_Line instance. Data is not quaranteed to be duplicated.
ToGHLine_Secondary
 Converts similar data into a GH_Line instance. Data is not quaranteed to be duplicated.
ToGHMatrix
 Convert data into ToGHMatrix.
ToGHMatrix_Primary
 Converts similar data into a GH_Matrix instance. Data is not quaranteed to be duplicated.
ToGHMatrix_Secondary
 Converts similar data into a GH_Matrix instance. Data is not quaranteed to be duplicated.
ToGHMesh
 Convert data into GH_Meshs.
ToGHMesh_Primary
 Converts similar data into a GH_Mesh instance. Data is not quaranteed to be duplicated.
ToGHMesh_Secondary
 Converts similar data into a GH_Mesh instance. Data is not quaranteed to be duplicated.
ToGHMeshFace
 Convert data into GH_MeshFaces.
ToGHMeshFace_Primary
 Converts similar data into a GH_MeshFace instance. Data is not quaranteed to be duplicated.
ToGHMeshFace_Secondary
 Converts similar data into a GH_MeshFace instance. Data is not quaranteed to be duplicated.
ToGHNumber
 Convert data into GH_Number.
ToGHNumber_Primary
 Converts similar data into a GH_Number instance. Data is not quaranteed to be duplicated.
ToGHNumber_Secondary
 Converts similar data into a GH_Number instance. Data is not quaranteed to be duplicated.
ToGHPlane
 Convert data into GH_Planes.
ToGHPlane_Primary
 Converts similar data into a GH_Plane instance. Data is not quaranteed to be duplicated.
ToGHPlane_Secondary
 Converts similar data into a GH_Plane instance. Data is not quaranteed to be duplicated.
ToGHPoint
 Convert data into GH_Points.
ToGHPoint_Primary
 Converts similar data into a GH_Point instance. Data is not quaranteed to be duplicated.
ToGHPoint_Secondary
 Converts similar data into a GH_Point instance. Data is not quaranteed to be duplicated.
ToGHRectangle
 Convert data into GH_Rectangles.
ToGHRectangle_Primary
 Converts similar data into a GH_Rectangle instance. Data is not quaranteed to be duplicated.
ToGHRectangle_Secondary
 Converts similar data into a GH_Rectangle instance. Data is not quaranteed to be duplicated.
ToGHString
 Convert data into GH_String.
ToGHString_Primary
 Converts similar data into a GH_String instance. Data is not quaranteed to be duplicated.
ToGHString_Secondary
 Converts similar data into a GH_String instance. Data is not quaranteed to be duplicated.
ToGHSurface
 Convert data into GH_Surfaces.
ToGHSurface_Primary
 Converts similar data into a GH_Surface instance. Data is not quaranteed to be duplicated.
ToGHSurface_Secondary
 Converts similar data into a GH_Surface instance. Data is not quaranteed to be duplicated.
ToGHTime
 Convert data into GH_Time.
ToGHTime_Primary
 Converts similar data into a GH_Time instance. Data is not quaranteed to be duplicated.
ToGHTime_Secondary
 Converts similar data into a GH_Time instance. Data is not quaranteed to be duplicated.
ToGHVector
 Convert data into GH_Vectors.
ToGHVector_Primary
 Converts similar data into a GH_Vector instance. Data is not quaranteed to be duplicated.
ToGHVector_Secondary
 Converts similar data into a GH_Vector instance. Data is not quaranteed to be duplicated.
ToGoo
 Converts an object into Goo. Does not duplicate the data if a lossless conversion is possible.
ToGUID
 Convert data into Guids.
ToGUID_Primary
 Performs a direct cast from Guid, GH_Guid, String and GH_String.
ToGUID_Secondary
 Performs indirect casts from other data types into Guids.
ToInt32
 Convert data into Int32s.
ToInt32_Primary
 Performs a direct cast from Int32 or GH_Integer.
ToInt32_Secondary
 Performs indirect casts from other data types into Integers.
ToInterval
 Convert data into Rhino.Geometry.Interval.
ToInterval_Primary
 Performs a direct cast from OnInterval or GH_Interval.
ToInterval_Secondary
 Attempts to convert other data types into an Interval. Data is not quaranteed to be duplicated.
ToLine
 Convert data into Rhino.Geometry.Line.
ToLine_Primary
 Performs a direct cast from OnLine or GH_Line. Data is not quaranteed to be duplicated.
ToLine_Secondary
 Attempts to convert other data types into an OnLine. Data is not quaranteed to be duplicated.
ToMatrix
 Convert data into Rhino.Geometry.Matrix.
ToMatrix_Primary
 Performs a direct cast from Matrix or GH_Matrix.
ToMatrix_Secondary
 Attempts to convert other data types into a Matrix. Data is not quaranteed to be duplicated.
ToMesh
 Convert data into Rhino.Geometry.Mesh.
ToMesh_Primary
 Performs a direct cast from OnMesh or GH_Mesh. Data is not quaranteed to be duplicated.
ToMesh_Secondary
 Attempts to convert other data types into an OnMesh. Data is not quaranteed to be duplicated.
ToNextPowerOfTen
 Round a number upwards to the nearest power of ten.
ToPlane
 Convert data into Rhino.Geometry.Plane.
ToPlane_Primary
 Performs a direct cast from OnPlane or GH_Plane. Data is not quaranteed to be duplicated.
ToPlane_Secondary
 Attempts to convert other data types into an OnPlane. Data is not quaranteed to be duplicated.
ToPlural
 Apply english rules to convert a noun into its plural form. This algorithm is not water-tight as it will not handle any irregular cases.
ToPoint
 Convert a floating point GDI point structure to an integer rounded point.
ToPoint3d
 Convert data into Rhino.Geometry.Point3d.
ToPoint3d_Primary
 Performs a direct cast from On3dPoint or GH_Point. Data is not quaranteed to be duplicated.
ToPoint3d_Secondary
 Attempts to convert other data types into an Point. Data is not quaranteed to be duplicated.
ToPointF
 Convert a Rhino SDK point structure to a GDI point structure.
ToPrevPowerOfTen
 Round a number downwards to the nearest power of ten.
ToRectangle
 Convert a floating point GDI rectangle structure to an integer rounded rectangle. Use this method for any and all GUI conversions as the specific rounding scheme used here avoids pixel jitter.
ToRectangle3d
 Convert data into Rhino.Geometry.Line.
ToRectangle3d_Primary
 Performs a direct cast from Rectangle3d or GH_Rectangle. Data is not quaranteed to be duplicated.
ToRectangle3d_Secondary
 Attempts to convert other data types into a Rectangle3d. Data is not quaranteed to be duplicated.
ToRelativePath |  Obsolete.
 Create a relative path from two absolute paths.
ToSHA_Hash(Byte[])
 Create a SHA hash. The hash algorithm is only guaranteed to yield the same results from within a unique application domain.
ToSHA_Hash(Stream)
 Create a SHA hash. The hash algorithm is only guaranteed to yield the same results from within a unique application domain.
ToSize
 Convert a floating point GDI size structure to an integer rounded size.
ToString
 Convert data into Colors.
ToString_Primary
 Performs a direct cast from String and GH_String.
ToString_Secondary
 Creates a String representation of an object by calling the ToString() function.
ToSurface
 Convert data into Rhino.Geometry.Surface.
ToSurface_Primary
 Performs a direct cast from OnSurface or GH_Surface. Data is not quaranteed to be duplicated. If data is of type GH_Surface, then trim curves are ignored.
ToSurface_Secondary
 Attempts to convert other data types into an IOnSurface. Data is not quaranteed to be duplicated.
ToUVInterval
 Convert data into Grasshopper.Kernel.Types.UVInterval.
ToUVInterval_Primary
 Performs a direct cast from UVInterval or GH_Interval2D.
ToUVInterval_Secondary
 Attempts to convert other data types into a UVInterval. Data is not quaranteed to be duplicated.
ToVariableName
 Extract the implied variable name from a compound string. A string is considered compound if it contains a parenthesis pair with at least one character within the brackets.
ToVariant
 Convert an object to a Grasshopper Expression Variant if possible.
ToVector3d
 Convert data into Rhino.Geometry.Vector3d.
ToVector3d_Primary
 Performs a direct cast from On3dVector or GH_Vector. Data is not quaranteed to be duplicated.
ToVector3d_Secondary
 Attempts to convert other data types into a Vector. Data is not quaranteed to be duplicated.
Top
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace