Grasshopper SDK
GH_Material Constructor
Overload List
Name | Description
GH_Material()
Initializes a new instance of the GH_Material class
GH_Material(DisplayMaterial)
 Create a new Material.
GH_Material(Color)
 Create a new material based on a colour. The colour is used to control Diffuse, Emission and Transparency. Ambient, Specular and Shine are always default.
GH_Material(Guid)
 Create a new Material from an RDK shader ID.
GH_Material(GH_Material)
 Copy another GH_Material instance.
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace