Grasshopper API
ChunkKeyedCollection.Remove Method
Overload List
Name | Description
Remove(GH_Chunk)
Remove(ID)
Top
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace