Grasshopper SDK
GH_Document.FindObject Method
Overload List
Name | Description
FindObject(PointF, Single)
 Find the topmost object that is closest to the point
FindObject(Guid, Boolean)
 Find the object that matches the ID.
FindObject<T>(Guid, Boolean)
 Find the object that matches the ID.
Top
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace