Grasshopper API
GH_Param<T>.AddVolatileData Method
Overload List
Name | Description
AddVolatileData(GH_Path, Int32, Object)
 Inserts an item of volatile data into the data structure.
AddVolatileData(GH_Path, Int32, T)
Top
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace