Grasshopper SDK
GH_AsynchFileData.StartPeriodicUpdate Method
Overload List
Name | Description
StartPeriodicUpdate()
 Starts periodic updating (from now), using typical periods depending on the physical location of the file. If you call this method you must call StopPeriodicUpdate() when done.
StartPeriodicUpdate(Int32)
 Starts periodic updating (from now).
StartPeriodicUpdate(TimeSpan)
 Starts periodic updating (from now).
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace