Grasshopper SDK
GH_UndoUtil.RecordWireEvent Method
Overload List
Name | Description
RecordWireEvent(String, IGH_Param)
 Create and Record a new WiresChanged undo record.
RecordWireEvent(String, IEnumerable<IGH_Param>)
 Create and Record a new WiresChanged undo record.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace