Grasshopper API
GH_UndoUtil.RecordEvent Method
Overload List
Name | Description
RecordEvent(GH_UndoRecord)
 Add a new record to the undo stack of the owner document.
RecordEvent(String, IGH_UndoAction)
 Add a new record to the undo stack of the owner document.
RecordEvent(String, IGH_UndoAction[])
 Add a new record to the undo stack of the owner document.
RecordEvent(String, IEnumerable<IGH_UndoAction>)
 Add a new record to the undo stack of the owner document.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace