Grasshopper SDK
GH_Line Constructor
Overload List
Name | Description
GH_Line()
 Default constructor
GH_Line(Line)
 Create a duplicate of another line.
GH_Line(GH_Line)
 Create a duplicate of another line.
Top
See Also
Reference
GH_Line Class
Grasshopper.Kernel.Types Namespace