Grasshopper API
GH_Structure<T>.DataList Property
Overload List
Name | Description
DataList[Int32]
 Gets a direct pointer to the list of data under the specified index.
DataList[GH_Path]
 Gets a direct pointer to the list of data under a specific path.
Top
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace