Grasshopper SDK
GH_VarParamEventArgs Constructor
Overload List
Name | Description
GH_VarParamEventArgs(IGH_Param, GH_VarParamSide)
Initializes a new instance of the GH_VarParamEventArgs class
GH_VarParamEventArgs(IGH_Param, GH_VarParamSide, Int32)
Initializes a new instance of the GH_VarParamEventArgs class
Top
See Also
Reference
GH_VarParamEventArgs Class
Grasshopper.Kernel Namespace