Grasshopper API
GH_UndoUtil.CreateLayoutEvent Method
Overload List
Name | Description
CreateLayoutEvent(String, IGH_DocumentObject)
 Create a new undo record for a single object layout change. This function must be called before the layout is changed.
CreateLayoutEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object layout changes. This function must be called before the layouts are changed.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace