Grasshopper API
GH_DocumentServer.AddDocument Method
Overload List
Name | Description
AddDocument(GH_Document)
 Add a new document to the global list. If the document is already registered nothing will happen.
AddDocument(String, Boolean)
 Add a new document to the global list. If there already is a document with the given path, it will be made active.
Top
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace