Grasshopper API
GH_UndoUtil.CreateRemoveObjectEvent Method
Overload List
Name | Description
CreateRemoveObjectEvent(String, IGH_DocumentObject)
 Create a new undo record for a single object removal.
CreateRemoveObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object removals.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace