Grasshopper API
EtoExtensions.ToSD Method
Overload List
Name | Description
ToSD(Color)
ToSD(Font)
ToSD(Point)
ToSD(Rectangle)
ToSD(Size)
Top
See Also
Reference
EtoExtensions Class
Grasshopper Namespace