Grasshopper API
GH_UndoUtil.RecordPivotEvent Method
Overload List
Name | Description
RecordPivotEvent(String, IGH_DocumentObject)
 Create and Record a new PivotChanged undo record.
RecordPivotEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new PivotChanged undo record.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace