Grasshopper API
GH_DocumentRenderMeshProvider.BuildCustomMeshes Method
Overload List
Name | Description
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes).)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace