Grasshopper API
GH_UndoUtil.CreateAddObjectEvent Method
Overload List
Name | Description
CreateAddObjectEvent(String, IGH_DocumentObject)
 Create a new undo record for a single object addition.
CreateAddObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object additions.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace