Grasshopper API
GH_Mesh.LoadGeometry Method
Overload List
Name | Description
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Mesh Class
Grasshopper.Kernel.Types Namespace