Grasshopper SDK
GH_UndoUtil.RecordRemoveObjectEvent Method
Overload List
Name | Description
RecordRemoveObjectEvent(String, IGH_DocumentObject)
 Create and Record a new ObjectRemoved undo record.
RecordRemoveObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new ObjectRemoved undo record.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace