Grasshopper API
GH_Curve.LoadGeometry Method
Overload List
Name | Description
LoadGeometry(RhinoDoc)
 If the curve is referenced and not yet loaded, attempts to load the curve.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace