Grasshopper API
GH_PersistentParam<T>.AddPersistentData Method
Overload List
Name | Description
AddPersistentData(Object) |  Obsolete.
 Utility function to add a new persistent data item. If the data is null or cannot be converted into T, this method will fail. You should probably use the PersistentData property to add type-safe data if you can.
AddPersistentData(T) |  Obsolete.
 Utility function to add a new persistent data item. If the data is null or cannot be converted into T, this method will fail. You should probably use the PersistentData property to add type-safe data if you can.
Top
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace