Grasshopper API
GH_Plane.LoadGeometry Method
Overload List
Name | Description
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace