Grasshopper SDK
GH_UpgradeUtil.MigrateSources Method
Overload List
Name | Description
MigrateSources(IGH_Param, IGH_Param)
 Migrate all sources from A to B, while maintaining order.
MigrateSources(IEnumerable<IGH_Param>, IGH_Param)
 Utility method for bulk assigning a bunch of sources.
Top
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace