Grasshopper API
GH_UndoUtil.CreatePivotEvent Method
Overload List
Name | Description
CreatePivotEvent(String, IGH_DocumentObject)
 Create a new undo record for a single pivot change. This function must be called before the pivot is changed.
CreatePivotEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of pivot changes. This function must be called before the pivots are changed.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace