Grasshopper API
GH_UndoUtil.CreateWireEvent Method
Overload List
Name | Description
CreateWireEvent(String, IGH_Param)
 Create a new undo record for a set of Connector wire changes. This function must be called before the wires are changed.
CreateWireEvent(String, IEnumerable<IGH_Param>)
 Create a new undo record for a set of Connector wire changes. This function must be called before the wires are changed.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace