Grasshopper API
GH_DocumentRenderMeshProvider.BoundingBox Method
Overload List
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes).)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace