Grasshopper API
GH_UndoUtil.RecordAddObjectEvent Method
Overload List
Name | Description
RecordAddObjectEvent(String, IGH_DocumentObject)
 Create and Record a new ObjectAdded undo record.
RecordAddObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new ObjectAdded undo record.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace