Grasshopper SDK
GH_AsynchFileData Constructor
Overload List
Name | Description
GH_AsynchFileData(String, Boolean)
 Synchronous constructor.
GH_AsynchFileData(String, Boolean, GH_AsynchFileData.FileChangedDelegate)
 Asynchronous constructor. File properties will be loaded asychronously.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace