Grasshopper SDK
GH_DocumentRenderMeshProvider.WillBuildCustomMeshes Method
Overload List
Name | Description
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes).)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace