Grasshopper API
GH_ComponentServer.LoadExternalFiles Method
Overload List
Name | Description
LoadExternalFiles() |  Obsolete.
 Attempt to parse all external files. This includes GHA libraries, GHUSER objects and GHCLUSTER files.
LoadExternalFiles(Boolean)
 Attempt to parse all external files. This includes GHA libraries, GHUSER objects and GHCLUSTER files.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace