Grasshopper API
GH_UpgradeUtil.MigrateRecipients Method
Overload List
Name | Description
MigrateRecipients(IGH_Param, IGH_Param)
 Migrate all recipients from A to B, while maintaining order.
MigrateRecipients(IEnumerable<IGH_Param>, IGH_Param)
 Utility method for bulk assigning a bunch of sources.
Top
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace