Grasshopper API
GH_UndoUtil.RecordLayoutEvent Method
Overload List
Name | Description
RecordLayoutEvent(String, IGH_DocumentObject)
 Create and Record a new LayoutChanged undo record.
RecordLayoutEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new LayoutChanged undo record.
Top
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace