Grasshopper SDK
GH_Path Constructor
Overload List
Name | Description
GH_Path()
 Default constructor, creates a path with zero elements.
GH_Path(Int32)
 Creates a new path with a single element.
GH_Path(Int32[])
 Creates a new path from a series of elements.
GH_Path(GH_Path)
 Creates an exact copy of another path.
Top
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace