Grasshopper API
GH_YakDownloadFormEto.Item.Id Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.GH_YakDownloadFormEto.Item.Id"]
See Also
Reference
GH_YakDownloadFormEto.Item Class
Grasshopper.GUI Namespace