Grasshopper API
GH_Document.ContainsCustomRenderObjects Property
 Gets whether this document contains custom preview objects which are both ENABLED and included in RENDERING.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public bool ContainsCustomRenderObjects { get; }
Public ReadOnly Property ContainsCustomRenderObjects As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ContainsCustomRenderObjects"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace