Grasshopper API
GH_Document.CustomRenderObjects Property
 Enumerate over all enabled, rendering, non-empty custom preview objects.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public IEnumerable<GH_CustomPreviewComponent> CustomRenderObjects { get; }
Public ReadOnly Property CustomRenderObjects As IEnumerable(Of GH_CustomPreviewComponent)
	Get
Property Value
Type: IEnumerable<GH_CustomPreviewComponent>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.CustomRenderObjects"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace