Grasshopper API
GH_YakDownloadFormEto.Item.Name Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_YakDownloadFormEto.Item.Name"]
See Also
Reference
GH_YakDownloadFormEto.Item Class
Grasshopper.GUI Namespace