Grasshopper API
GH_ComponentServer Properties
The GH_ComponentServer type exposes the following members.
Properties
Name | Description
Aliases
 Gets a list of all the defined aliases.
AllAddOns |  Obsolete.
 Gets a list of all the gha and ghuser files that will be loaded as Grasshopper add-ons.
CompleteRibbonLayout
 Gets the default component layout featuring all non-hidden components and parameters.
DiscardedProxies
 Returns the total number of IGH_DocumentObjects that were discarded during assembly parsing. This includes both skipped and replaced proxies.
GraphProxies
 Returns a list of all cached GH_GraphProxy instances.
Libraries
 Returns a list of Assembly Info objects describing all loaded assemblies.
LoadingExceptions
 Gets a list of all the exceptions that were recorded during the most recent loading sequence.
ObjectProxies
 Returns a list of all cached GH_ObjectProxy instances.
ObjectProxyNames
 Returns a specialized string collection of all component names.
TypeHints
 Gets a list of all IGH_TypeHint types in all loaded assemblies.
Upgraders
 Gets a list of all the upgraders that have been cached.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace