Grasshopper API
GH_ValueProxy<T> Properties
The GH_ValueProxy<T> generic type exposes the following members.
Properties
Name | Description
IsParsable
IsValid
ProxyName
ProxyType
ProxyValue
UserString
 Wraps the protected m_UserString field
Value
Top
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace