Grasshopper API
GH_DocumentRenderMeshProvider Properties
The GH_DocumentRenderMeshProvider type exposes the following members.
Properties
Name | Description
Name |  (Overrides CustomRenderMeshProvider.Name.)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace