Grasshopper API
Item Properties
The GH_YakDownloadForm.Item type exposes the following members.
Properties
Name | Description
Id
Name
Version
Top
See Also
Reference
GH_YakDownloadForm.Item Class
Grasshopper.GUI Namespace