Grasshopper API
GH_VarParamEventArgs Properties
The GH_VarParamEventArgs type exposes the following members.
Properties
Name | Description
Index
 Gets the index of the parameter.
Param
 Gets the parameter.
Side
 Gets the side of the parameter.
Top
See Also
Reference
GH_VarParamEventArgs Class
Grasshopper.Kernel Namespace