Grasshopper API
GH_GooProxy<T> Properties
The GH_GooProxy<T> generic type exposes the following members.
Properties
Name | Description
IsParsable
 Gets a value indicating whether or not the type can be instantiated from a String.
Owner
ProxyOwner
 Gets the piece of Grasshopper data that spawned this proxy.
TypeDescription
TypeName
UserString
 Gets or sets the user-defined string that describes this proxy. This only really makes sense if the Proxy is Parsable.
Valid
 Gets a value indicating whether this proxy represents valid data.
Top
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace