Grasshopper API
Item Properties
The GH_YakDownloadFormEto.Item type exposes the following members.
Properties
Name | Description
Id
Name
Version
Top
See Also
Reference
GH_YakDownloadFormEto.Item Class
Grasshopper.GUI Namespace