Grasshopper SDK
IGH_VarParamComponent Properties
The IGH_VarParamComponent type exposes the following members.
Properties
Name | Description
IsInputVariable
 Gets a flag specifying whether or not the input can potentially contain variable parameters.
IsOutputVariable
 Gets a flag specifying whether or not the output can potentially contain variable parameters.
Top
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace