Grasshopper API
GH_DocumentEditor Properties
The GH_DocumentEditor type exposes the following members.
Properties
Name | Description
Collapsed
 Gets a value indicating whether or not the form is currently collapsed.
FormShepard
 Gets the form shepard for this window. Register your modeless dialogs with this shepard if you want to be popular.
Top
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace