Grasshopper API
GH_AssemblyInfoStub Properties
The GH_AssemblyInfoStub type exposes the following members.
Properties
Name | Description
AssemblyName |  (Overrides GH_AssemblyInfo.AssemblyName.)
AssemblyVersion |  (Overrides GH_AssemblyInfo.AssemblyVersion.)
Top
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace