Grasshopper SDK
CentralSettings Properties
The CentralSettings type exposes the following members.
Properties
Name | Description
AuthorAddress
 Gets or sets the default author address to be used for all data generated by this Grasshopper installation.
AuthorCompany
 Gets or sets the default author company to be used for all data generated by this Grasshopper installation.
AuthorCopyright
 Gets or sets the default author copyright to be used for all data generated by this Grasshopper installation.
AuthorCopyrightFormatted
 Gets the authorCopyright message formatted to match the current date.
AuthorDetails
 Gets a new GH_AuthorDetails instance populated with the current settings. Changing this instance does not affect the settings.
AuthorEMail
 Gets or sets the default author e-mail to be used for all data generated by this Grasshopper installation.
AuthorName
 Gets or sets the default author name to be used for all data generated by this Grasshopper installation.
AuthorPhone
 Gets or sets the default author phone to be used for all data generated by this Grasshopper installation.
AuthorWebsite
 Gets or sets the default author website to be used for all data generated by this Grasshopper installation.
CanvasFancyWires
 Gets or sets whether or not fancy wires will be drawn. This is a global setting.
CanvasFullNames
 Gets or sets the global default for verbose UI. When CanvasFullNames=True, parameter nicknames are set to their actual (long) names upon addition.
CanvasObjectIcons
 Gets or sets the global default for icon display.
CanvasObsoleteTags
 Gets or sets the global default for obsolete tags.
CanvasRadialMenu
 Gets or sets the global default for whether the canvas should use Radial or olds-kool menus.
CanvasZuiZoomLevel
 Gets or sets the global Zui zoom threshold.
ComponentCascadeMenus
 Gets or sets whether Grasshopper document solutions are wrapped in undo records.
CreateSolutionUndoRecord
 Gets or sets whether Grasshopper document solutions are wrapped in undo records.
FormatDecimalDigits
 Gets or sets how many digits ought to be used for decimal formatted numbers.
FormatENotationDigits
 Gets or sets how many digits ought to be used for scientific notation formatted numbers.
FormatENotationLowerLimit
 Gets or sets at what power of ten decimal formatting of numbers switches to E notation for small numbers.
FormatENotationLowerThreshold
 Gets at what actual threshold numeric formatting switches from decimal to E-Notation.
FormatENotationUpperLimit
 Gets or sets at what power of ten decimal formatting of numbers switches to E notation for large numbers.
FormatENotationUpperThreshold
 Gets at what actual threshold numeric formatting switches from decimal to E-Notation.
FormatMultiplesOfOne
 Gets or sets whether floating point numbers close to whole integers should be special cased.
FormatMultiplesOfPi
 Gets or sets whether multiples of 0.5*Pi ought to be special cased.
IsTemplateFile
 Gets whether a template file has been defined and whether that file ectually exists.
PreviewBumpZBuffer
 Gets or sets whether the Document preview bumps the Z-Buffer. Setting this value automatically causes a redraw of the Rhino viewports.
PreviewGumballs
 Gets or sets whether the gumballs will be visible for selected preview geometry.
PreviewMeshEdges
 Gets or sets the Mesh Wire display flag.
PreviewPlaneRadius
 Gets or sets the global Plane radius.
PreviewPointStyle
 Gets or sets the point style for Grasshopper preview points.
PreviewSelectionThickening
 Gets or sets the amount of thickening to apply to selected wires.
PruderyLevel
 Gets or sets the Grasshopper UI prudery level.
RibbonDrawTabIcons
 Gets or sets whether tab icons are drawn for the ribbon.
RibbonSeparators
 Gets or sets whether there are separators between different exposures on the component Ribbon.
RibbonShowObscure
 Gets or sets a value indicating whether components marked with DropDown exposure are drawn on the main toolbar anyway.
RibbonVisible
 Gets or sets a value indicating whether components marked with DropDown exposure are drawn on the main toolbar anyway.
ShowTutorials
 Gets or sets whether the tutorial browser is shown on Grasshopper load.
TemplateFile
 Gets or sets the template file path. Use String.Empty or Nothing to disable the template file.
TooltipWiggleRadius
 Gets or sets the wiggle radius (in pixels) which the mouse is allowed to move before the tooltip is nuked.
Top
See Also
Reference
CentralSettings Class
Grasshopper Namespace