Grasshopper API
GH_Author Properties
The GH_Author type exposes the following members.
Properties
Name | Description
Address
AddressReadonly
Company
CompanyReadonly
Copyright
CopyrightReadonly
EMail
EMailReadonly
IsEmpty
 Gets whether any of the fields have been assigned.
Name
NameReadonly
Phone
PhoneReadonly
Website
WebsiteReadonly
Top
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace