Grasshopper API
ChunkKeyedCollection Properties
The GH_Chunk.ChunkKeyedCollection type exposes the following members.
Properties
Name | Description
Count
Top
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace