Grasshopper API
GH_DocumentIO Properties
The GH_DocumentIO type exposes the following members.
Properties
Name | Description
Document
 Gets or sets the internal document.
IsDocument
 Gets a value indicating whether or not this instance of GH_DocumentIO contains an internal document.
Top
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace