Grasshopper API
GH_Vector Properties
The GH_Vector type exposes the following members.
Properties
Name | Description
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Vector Class
Grasshopper.Kernel.Types Namespace