Grasshopper SDK
ID Structure
 An ID is used to uniquely identify a specific item.
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public struct ID : IComparable<ID>
Public Structure ID
	Implements IComparable(Of ID)
The ID type exposes the following members.
Constructors
Name | Description
ID(String)
 Constuctor for IDs.
ID(String, Int32)
 Constructor for IDs.
Top
Properties
Name | Description
HasIndex
 Gets whether the index has been set.
HasName
 Gets whether the name has been set. Every valid ID must have a name.
Index
 Gets the index of this ID, if there is no valid index then -1 is returned.
Name
 Gets the name of this ID.
Top
Methods
Name | Description
ToString
 Gets a string representation for this ID.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
GH_IO.Serialization Namespace