Grasshopper API
GH_AsynchFileData Class
 This class provides asynchronous methods to keep tabs on a file.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_AsynchFileData
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_AsynchFileData : IDisposable
Public Class GH_AsynchFileData
	Implements IDisposable
The GH_AsynchFileData type exposes the following members.
Constructors
Name | Description
GH_AsynchFileData
 Asynchronous constructor. File properties will be loaded asychronously.
Top
Properties
Name | Description
Callback
 Gets or sets the callback delegate to be used when properties are updated.
FileCreated
 Gets the date at which the file was created.
FileExists
 Gets whether the file exists. Note that this property returns false if DataExists=False, regardless of whether the file exists.
FileLastChanged
 Gets the date at which the file was last changed.
FileSize
 Gets the size of the file.
FileThumbnail
 Gets the thumbnail bitmap associated with the file.
IsFileData
 Gets whether the data has been retrieved at least once.
Thumbnail
 Gets or sets whether the thumbnail ought to be parsed. At the moment this only makes sense for GH/GHX files.
Top
Methods
Name | Description
Dispose
Releases all resources used by the GH_AsynchFileData
StartPeriodicUpdate
 Starts periodic updating (from now).
StopPeriodicUpdate
 Stop any periodic updates.
UpdateProperties
 Updates all file properties on the thread on which this method is called.
UpdatePropertiesAsynch
 Updates all file properties on a low-priority background thread.
Top
Fields
Name | Description
FilePath
 Gets the location this class is watching.
LocalUpdatePeriod
 Specifies the number of milliseconds in between periodic checks for files on the local system.
RemoteUpdatePeriod
 Specifies the number of milliseconds in between periodic checks for files on network drives.
Top
See Also
Reference
Grasshopper.GUI Namespace