Grasshopper SDK
CentralSettings.AuthorWebsiteChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void AuthorWebsiteChangedEventHandler()
Public Delegate Sub AuthorWebsiteChangedEventHandler
See Also
Reference
Grasshopper Namespace