Grasshopper API
EtoExtensions Class
Inheritance Hierarchy
System.Object
 Grasshopper.EtoExtensions
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public sealed class EtoExtensions
<ExtensionAttribute>
Public NotInheritable Class EtoExtensions
The EtoExtensions type exposes the following members.
Methods
Name | Description
ToEto(Bitmap) |  Obsolete.
ToEto(Color)
ToEto(Font)
ToEto(Point)
ToEto(Control)
ToEto(Form)
ToSD(Color)
ToSD(Font)
ToSD(Point)
ToSD(Rectangle)
ToSD(Size)
ToWin32Window
Top
See Also
Reference
Grasshopper Namespace