Grasshopper SDK
GH_RenderArgs Class
 This class is passed to objects that implement IGH_RenderAwareData or IGH_RenderAwareObject during render queue operations.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_RenderArgs
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public class GH_RenderArgs
Public Class GH_RenderArgs
The GH_RenderArgs type exposes the following members.
Constructors
Name | Description
GH_RenderArgs(RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid)
 Create new render arguments.
GH_RenderArgs(RhinoDoc, ViewportInfo, RenderPrimitiveList, Guid, RenderMaterial, RenderMaterial) |  Obsolete.
 Create new render arguments.
Top
Properties
Name | Description
Document
 Gets the rhino document from whence the render originated.
Geomety
 Gets the geometry primitive list to append to.
MaterialNormal |  Obsolete.
 Gets the material hint to use for unselected objects.
MaterialSelected |  Obsolete.
 Gets the material hint to use for selected objects.
PluginId
 Gets the render plugin id that is about to render this geometry.
Viewport
 Gets the viewport details involved in this rendering.
Top
See Also
Reference
Grasshopper.Kernel Namespace