Grasshopper API
GH_YakDownloadForm.Item Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_YakDownloadForm.Item
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class Item
Public Class Item
The GH_YakDownloadForm.Item type exposes the following members.
Constructors
Name | Description
GH_YakDownloadForm.Item
Initializes a new instance of the GH_YakDownloadForm.Item class
Top
Properties
Name | Description
Id
Name
Version
Top
See Also
Reference
Grasshopper.GUI Namespace