Grasshopper SDK
CentralSettings.PreviewGumballsChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void PreviewGumballsChangedEventHandler()
Public Delegate Sub PreviewGumballsChangedEventHandler
See Also
Reference
Grasshopper Namespace