Grasshopper API
GH_DocumentRenderMeshProvider Class
 Utility class for seeding render queues with GH geometry.
Inheritance Hierarchy
System.Object
 CustomRenderMeshProvider
 CustomRenderMeshProvider2
 Grasshopper.Kernel.GH_DocumentRenderMeshProvider
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public class GH_DocumentRenderMeshProvider : CustomRenderMeshProvider2
Public Class GH_DocumentRenderMeshProvider
	Inherits CustomRenderMeshProvider2
The GH_DocumentRenderMeshProvider type exposes the following members.
Constructors
Name | Description
GH_DocumentRenderMeshProvider
Initializes a new instance of the GH_DocumentRenderMeshProvider class
Top
Properties
Name | Description
Name |  (Overrides CustomRenderMeshProvider.Name.)
Top
Methods
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider2.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes).)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes) |  (Overrides CustomRenderMeshProvider2.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes).)
Top
See Also
Reference
Grasshopper.Kernel Namespace