Grasshopper SDK
GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler Delegate
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void AutoSaveFileFormatChangedEventHandler()
Public Delegate Sub AutoSaveFileFormatChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace