Grasshopper SDK
CentralSettings.CreateSolutionUndoRecordChangedEventHandler Delegate
 Namespace: Grasshopper
 Assembly: Grasshopper (in Grasshopper.dll) Version: Rhino 6.0
Syntax
public delegate void CreateSolutionUndoRecordChangedEventHandler()
Public Delegate Sub CreateSolutionUndoRecordChangedEventHandler
See Also
Reference
Grasshopper Namespace