Grasshopper API
IGH_RenderAwareObject Interface
Note: This API is now obsolete.
 Implement this interface in your IGH_DocumentObject type if you wish to send geometry to a render queue.
 Namespace: Grasshopper.Kernel
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
[ObsoleteAttribute("This interface is now obsolete. Render meshes are bottlenecked through the Custom Display component.")]
public interface IGH_RenderAwareObject
<ObsoleteAttribute("This interface is now obsolete. Render meshes are bottlenecked through the Custom Display component.")>
Public Interface IGH_RenderAwareObject
The IGH_RenderAwareObject type exposes the following members.
Methods
Name | Description
AppendRenderGeometry |  Obsolete.
Top
See Also
Reference
Grasshopper.Kernel Namespace